<a href="https://colab.research.google.com/github/briankunya04k-sudo/Assignment-/blob/main/PandasFundamentals.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [1]:
data={

      'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
      'Age': [25, 30, 35, 28],
      'Salary': [50000, 60000, 70000, 55000],
      'Department': ['HR', 'IT', 'Finance', 'HR']
}

In [4]:
Brian=pd.DataFrame(data)
print('Original DataFrame')
print(Brian)

Original DataFrame
      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   70000    Finance
3    Diana   28   55000         HR

In [6]:
print('\nFirst2 rows:')
print(Brian.head(2))

First2 rows:
    Name  Age  Salary Department
0  Alice   25   50000         HR
1    Bob   30   60000         IT

In [7]:
print('\nBasic statistics:')
print(Brian.describe())

Basic statistics:
             Age        Salary
count   4.000000      4.000000
mean   29.500000  58750.000000
std     4.203173   8539.125638
min    25.000000  50000.000000
25%    27.250000  53750.000000
50%    29.000000  57500.000000
75%    31.250000  62500.000000
max    35.000000  70000.000000

In [8]:
name_salary=Brian[['Name','Salary']]
print('\nName and Salary columns:')
print(name_salary)

Name and Salary columns:
      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
3    Diana   55000

In [9]:
#filter people older than 28
older_than_28=Brian[Brian['Age']>28]
print('\nPeople older than 28:')
print(older_than_28)
#

People older than 28:
      Name  Age  Salary Department
1      Bob   30   60000         IT
2  Charlie   35   70000    Finance

In [10]:
#add new column'Bonus as 10% of salary
Brian['Bonus']=Brian['Salary']*0.1
print('\nDataFrame with Bonus column:')
print(Brian)

DataFrame with Bonus column:
      Name  Age  Salary Department   Bonus
0    Alice   25   50000         HR  5000.0
1      Bob   30   60000         IT  6000.0
2  Charlie   35   70000    Finance  7000.0
3    Diana   28   55000         HR  5500.0